<?php
phpinfo();

echo 'Створити всі необхідні компоненти по лекції №16.

Створити трейт із базовими методами для моделі

static all() - виводить усі записи з таблиці
static find(int $id) - знаходить запис з id
static findBy($column, $value) - знаходить запис за значенням
static create($fields) - створює запис та повертає її id
update($fields) - оновлює поточний запис переданими полями (не статик функція!!)
static delete($id) - видаляє запис з id
static select() - готує запит для where
where(array ['column', '<', 'value']) - WHERE блок (не статик функція!!)
get() - кінцевий не статік метод, який викликається для отримання результату
Також можна додати свої методи для створення запитів';

1. Матчим урл (проверяем урл реквеста к тому что у нас есть и есть ли вобще)
2. Проверить МЕТОД запроса пользователя (GET, POST etc.)
3. Проверить существует ли контроллер привязанный к урлу в роуте
4. Проверить существует ли экшен привязанный к урлу в роуте и в контроллере
5. Если всё существует, то создаём контроллер и вызываем его метод
6. PROFIT!